<strong>pandas</strong> stands for panel data.<br>
its built directly off of numpy

In [8]:
#pandas series
import numpy as np
import pandas as pd

In [9]:
labels = ['a','b','c']
mylist = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [4]:
#series
pd.Series(data=mylist, index=labels)

a    10
b    20
c    30
dtype: int64

In [10]:
#dataframe
df = pd.DataFrame({'A':[1,2,np.nan,4],
                  'B':[5,np.nan,np.nan,8],
                  'C':[10,20,30,40]})

In [12]:
#preview
df.head()

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [13]:
df.fillna(0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [14]:
df.fillna(df.mean())

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40

In [15]:
df.fillna(df.median())

     A    B   C
0  1.0  5.0  10
1  2.0  6.5  20
2  2.0  6.5  30
3  4.0  8.0  40

In [17]:
#groupby
df = pd.read_csv('Data/Universities.csv')

In [18]:
df.head()

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada

In [30]:
df.groupby('Year').max()

,Sector,University,Completions,Geography
Year,,,,
2012,"Public, 4-year or above",Western Nevada College,5388,Nevada
2013,"Public, 4-year or above",Western Nevada College,5278,Nevada
2014,"Public, 4-year or above",Western Nevada College,5093,Nevada
2015,"Public, 4-year or above",Western Nevada College,5335,Nevada
2016,"Public, 4-year or above",Wongu University of Oriental Medicine,5367,Nevada